package utils

type item struct {
	Time    string
	Teacher string
	Class   string
	Name    string
}

type day struct {
	Code     string
	FullCode string
	IsGreen  bool
	Items    []item
}

var TimeSchedule = []day{
	{
		Code:     "1",
		FullCode: "Понедельник",
		IsGreen:  true,
		Items: []item{
			{
				"9:40-11:10",
				"Маклакова Ираида Петровна",
				"9-103",
				"ОСНОВЫ ПРОИЗВОДСТВА ЧУГУНА И СТАЛИ",
			},
			{
				"11:20-12:50",
				"Маклакова Ираида Петровна",
				"9-103",
				"ОСНОВЫ ПРОИЗВОДСТВА ЧУГУНА И СТАЛИ",
			},
			{
				"13:20-14:50",
				"Кияшова Наталья Николаевна",
				"Л-2",
				"Физическая химия",
			},
		},
	},
	{
		Code:     "2",
		FullCode: "Вторник",
		IsGreen:  true,
		Items: []item{
			{
				"11:20-12:50",
				"Маклакова Ираида Петровна",
				"Л-3 лек.",
				"ОСНОВЫ ПРОИЗВОДСТВА ЧУГУНА И СТАЛИ",
			},
			{
				"13:20-14:50",
				"Хромых Ольга Алексеевна",
				"Л-4 лек.",
				"ИСТОРИЯ",
			},
			{
				"15:00-16:30",
				"Кияшова Наталья Николаевна",
				"9-411 пр.",
				"Физическая химия",
			},
		},
	},
	{
		Code:     "3",
		FullCode: "Среда",
		IsGreen:  true,
		Items: []item{
			{
				"9:40-11:10",
				"Хромых Ольга Алексеевна",
				"141 пр",
				"ИСТОРИЯ",
			},
			{
				"11:20-12:50",
				"Маклакова Ираида Петровна",
				"Л3-Л",
				"ОСНОВЫ ПРОИЗВОДСТВА ЧУГУНА И СТАЛИ",
			},
			{
				"13:20-14:50",
				"Фаренбрух Анна Сергеевна Панов Геннадий Петрович",
				"Спортзал",
				"Физическая культура",
			},
			{
				"15:00-16:30",
				"Маклакова Ираида Петровна",
				"Л-3 лек.",
				"ОСНОВЫ ПРОИЗВОДСТВА ЧУГУНА И СТАЛИ",
			},
		},
	},
	{
		Code:     "4",
		FullCode: "Четверг",
		IsGreen:  true,
		Items: []item{
			{
				"11:20-12:50",
				"Семиряжко Вера Александровна",
				"341 пр",
				"МАТЕМАТИКА",
			},
			{
				"13:20-14:50",
				"Скаков Сергей Викторович",
				"411 лек",
				"Основы металлургического производства",
			},
			{
				"15:00-16:30",
				"Мавлина Ирина Трифоновна",
				"468 пр",
				"Иностранный язык в профессиональной деятельности",
			},
			{
				"16:40-18:10",
				"Куприянова Ирина Вячеславовна",
				"Л4-Л",
				"Обработка информации (из вариатива)",
			},
		},
	},
	{
		Code:     "5",
		FullCode: "Пятница",
		IsGreen:  true,
		Items: []item{
			{
				"11:20-12:50",
				"Куприянова Ирина Вячеславовна",
				"9-103 пр",
				"Обработка информации (из вариатива)",
			},
			{
				"13:20-14:50",
				"Скаков Сергей Викторович",
				"9-117 пр",
				"Основы металлургического производства",
			},
			{
				"15:00-16:30",
				"Казьмина Лилия Николаевна",
				"Л2 лек",
				"МАТЕМАТИКА",
			},
			{
				"16:40-18:10",
				"Скаков Сергей Викторович",
				"Л4-Л",
				"Основы металлургического производства",
			},
		},
	},
	{
		Code:     "1",
		FullCode: "Понедельник",
		IsGreen:  false,
		Items: []item{
			{
				"9:40-11:10",
				"Маклакова Ираида Петровна",
				"9-103",
				"ОСНОВЫ ПРОИЗВОДСТВА ЧУГУНА И СТАЛИ",
			},
			{
				"11:20-12:50",
				"Маклакова Ираида Петровна",
				"9-103",
				"ОСНОВЫ ПРОИЗВОДСТВА ЧУГУНА И СТАЛИ",
			},
			{
				"13:20-14:50",
				"Кияшова Наталья Николаевна",
				"Л-2",
				"Физическая химия",
			},
			{
				"13:20-14:50",
				"Куприянова Ирина Вячеславовна",
				"9-103 пр.",
				"Обработка информации (из вариатива)",
			},
		},
	},
	{
		Code:     "2",
		FullCode: "Вторник",
		IsGreen:  false,
		Items: []item{
			{
				"9:40-11:10",
				"Телегин Виктор Валериевич",
				"410 пр.",
				"ИНЖЕНЕРНАЯ ГРАФИКА",
			},
			{
				"11:20-12:50",
				"Маклакова Ираида Петровна",
				"Л-3 лек.",
				"ОСНОВЫ ПРОИЗВОДСТВА ЧУГУНА И СТАЛИ",
			},
			{
				"13:20-14:50",
				"Куприянова Ирина Вячеславовна",
				"9-103 пр.",
				"Обработка информации (из вариатива)",
			},
		},
	},
	{
		Code:     "3",
		FullCode: "Среда",
		IsGreen:  false,
		Items: []item{
			{
				"9:40-11:10",
				"Хромых Ольга Алексеевна",
				"141 пр",
				"ИСТОРИЯ",
			},
			{
				"11:20-12:50",
				"Маклакова Ираида Петровна",
				"255 лек.",
				"ИНЖЕНЕРНАЯ ГРАФИКА",
			},
			{
				"13:20-14:50",
				"Фаренбрух Анна Сергеевна Панов Геннадий Петрович",
				"Спортзал",
				"Физическая культура",
			},
			{
				"15:00-16:30",
				"Маклакова Ираида Петровна",
				"Л-3 лек.",
				"ОСНОВЫ ПРОИЗВОДСТВА ЧУГУНА И СТАЛИ",
			},
		},
	},
	{
		Code:     "4",
		FullCode: "Четверг",
		IsGreen:  false,
		Items: []item{
			{
				"11:20-12:50",
				"Семиряжко Вера Александровна",
				"341 пр",
				"МАТЕМАТИКА",
			},
			{
				"13:20-14:50",
				"Скаков Сергей Викторович",
				"411 лек",
				"Основы металлургического производства",
			},
			{
				"15:00-16:30",
				"Мавлина Ирина Трифоновна",
				"468 пр",
				"Иностранный язык в профессиональной деятельности",
			},
			{
				"16:40-18:10",
				"Куприянова Ирина Вячеславовна",
				"Л4-Л",
				"Обработка информации (из вариатива)",
			},
		},
	},
	{
		Code:     "5",
		FullCode: "Пятница",
		IsGreen:  false,
		Items: []item{
			{
				"13:20-14:50",
				"Скаков Сергей Викторович",
				"9-117 пр",
				"Основы металлургического производства",
			},
			{
				"15:00-16:30",
				"Казьмина Лилия Николаевна",
				"Л2 лек",
				"МАТЕМАТИКА",
			},
			{
				"16:40-18:10",
				"Скаков Сергей Викторович",
				"Л4-Л",
				"Основы металлургического производства",
			},
		},
	},
}
